; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-3 - location
	p0-4 - location
	p1-2 - location
	p1-4 - location
	p2-0 - location
	p2-4 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s1)
	(at driver3 s4)
	(at driver4 s2)
	(at driver5 s2)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s4)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s3)
	(at package2 s1)
	(at package3 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 72)
	(= (time-to-drive s3 s0) 72)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 85)
	(= (time-to-drive s4 s0) 85)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 38)
	(= (time-to-drive s0 s1) 38)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 5)
	(= (time-to-drive s4 s1) 5)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 56)
	(= (time-to-drive s0 s2) 56)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 12)
	(= (time-to-drive s1 s2) 12)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 96)
	(= (time-to-drive s4 s2) 96)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 43)
	(= (time-to-drive s2 s3) 43)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 92)
	(= (time-to-drive s4 s3) 92)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s3)
	(at truck2 s1)
	(at truck3 s1)
	(at truck4 s4)
	(at package1 s1)
	(at package2 s1)
	(at package3 s3)
	))

(:metric minimize (+ (* 2 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   goals met: 4 of 11
2. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 11
3. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   goals met: 5 of 11
4. (drive-truck truck3 s4 s3 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 0 to 920
   goals met: 5 of 11
5. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   goals met: 5 of 11
6. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   goals met: 6 of 11
7. (load-truck package1 truck3 s3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 11
8. (drive-truck truck3 s3 s2 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 920 to 1393
   goals met: 6 of 11
9. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 1393 to 1525
   goals met: 7 of 11
10. (walk driver4 s0 p0-3)
   deleted: (at driver4 s0)
   added: (at driver4 p0-3)
   goals met: 6 of 11
11. (walk driver4 p0-3 s3)
   deleted: (at driver4 p0-3)
   added: (at driver4 s3)
   goals met: 6 of 11
12. (board-truck driver4 truck4 s3)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 6 of 11
13. (drive-truck truck4 s3 s4 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (fuel-used) from 1525 to 2445
   goals met: 7 of 11
14. (unload-truck package1 truck3 s1)
   deleted: (in package1 truck3)
   added: (at package1 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 11
15. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 2445 to 2565
   goals met: 7 of 11
16. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 7 of 11
17. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 7 of 11
18. (board-truck driver5 truck3 s2)
   deleted: (at driver5 s2) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 7 of 11
19. (drive-truck truck4 s4 s0 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 2565 to 3415
   goals met: 6 of 11
20. (drive-truck truck3 s2 s1 driver5)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 3415 to 3535
   goals met: 7 of 11
21. (disembark-truck driver5 truck3 s1)
   deleted: (driving driver5 truck3)
   added: (at driver5 s1) (empty truck3)
   goals met: 7 of 11
22. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 8 of 11
23. (drive-truck truck4 s0 s4 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 3535 to 4385
   goals met: 9 of 11
24. (disembark-truck driver4 truck4 s4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s4) (empty truck4)
   goals met: 9 of 11
25. (walk driver5 s1 p0-1)
   deleted: (at driver5 s1)
   added: (at driver5 p0-1)
   goals met: 9 of 11
26. (walk driver4 s4 p0-4)
   deleted: (at driver4 s4)
   added: (at driver4 p0-4)
   goals met: 9 of 11
27. (walk driver4 p0-4 s0)
   deleted: (at driver4 p0-4)
   added: (at driver4 s0)
   goals met: 10 of 11
28. (walk driver5 p0-1 s0)
   deleted: (at driver5 p0-1)
   added: (at driver5 s0)
   goals met: 10 of 11
29. (walk driver5 s0 p0-3)
   deleted: (at driver5 s0)
   added: (at driver5 p0-3)
   goals met: 10 of 11
30. (walk driver5 p0-3 s3)
   deleted: (at driver5 p0-3)
   added: (at driver5 s3)
   goals met: 11 of 11
